//
//  ViewController.swift
//  Functions
//
//  Created by Костя Симончик on 26.10.22.
//

/*
 Домашнее задание:
 Основное:
 1. Написать универсальные функции сложения, вычитания, умножения и деления, которые принимают 2 Int (Пример: sum(value1: Int, value2: Int) -> Int), и использовать из в примере вычесления вместо стандартных +, -, *, / и сделать их глобальными
 2. Написать функцию, которая считает сумму цифр четырехзначного числа (func calcNumbers(value: Int)), для условности будем считать, что в функции будет передаваться 4-значное число (1999 -> 1 + 9 + 9 + 9)
 3. Написать функцию сравнения 2 строк и возвращающую самую длинную строку
 4. Циклический вызов функций - поломать приложение (написать функцию, которая вызывает сама себя)
 5. Написать функцию возведения в степень с дефолтным параметром (makePower), по умолчанию возводит число во вторую степень, но степень можно указать
 6. Написать функцию, которая принимает строку, добаляет к ней смайлики. Вернуть результат и распечатать.
 Дополнительно:
 1. Функция вычисления факториала числа
 2. Функция вычисления ряда фибоначи
 */


import UIKit

class ViewController: UIViewController {

    override func viewDidLoad() {
        super.viewDidLoad()

        

    }


}

